import re
import unittest
from 木兰.功用.规律 import *

class test正则(unittest.TestCase):

    def test_双引号字符串(self):
        双引号字符串 = r'(")((?<!\\)\\\1|.)*?\1'
        正确字符串 = ['""',
            r'"\""',  # 等价 '"\\""'
            r'"\"a"',
            r'"\c"',  # r'(\")((?<!\\)\\\1|(?<!\\).)*?\1' 不匹配, 因此 ?<! 仅作用于 \\\1 部分
            #r'"\\""'  匹配为 '"\\"'
            r'"\"a\"b"',
            '"abc"',
            r'"\n"',
            ]
        for 字符串 in 正确字符串:
            self.比较(双引号字符串, 字符串, 字符串)
        #TODO： 测试错误字符串

    def test_字符串插值(self):
        插值 = r'\\\(([^\\\)]*)\\\)|`([^`]*)`'
        期望 = {
            r'`ab`': r'`ab`',
            r'\(\)': r'\(\)',  # 不能与正则表达混淆, 反斜杠不需\\
            # r'\(\\)': r'\(\\)', # 不匹配
            # r'\()\)': r'\()\)', # 不匹配
            }
        for 字符串 in 期望:
            self.比较(插值, 字符串, 期望[字符串])

    def 比较(self, 表达式, 全文本, 目标匹配内容):
        m = re.search(表达式, 全文本)
        self.assertEqual(m.group(0), 目标匹配内容, "比较有误")

    def test_规律(self):
        self.assertEqual(一个("a").表达(), r"a")
        self.assertEqual(最多一个("$").一个("_", 大小写英文, 中文).任意个("_", 大小写英文, 数字, 中文).表达(),
            r'\$?[_a-zA-Z\u4e00-\u9fa5][_a-zA-Z0-9\u4e00-\u9fa5]*')

        self.assertEqual(不是(反斜杠, 右小括号).表达(), r'[^\\\)]')

        self.assertEqual(
            皆可(
                一个(反斜杠).一个(左小括号).分组(任意个(不是(反斜杠, 右小括号))).一个(反斜杠).一个(右小括号).表达(),
                一个(反引号).分组(任意个(不是(反引号))).一个(反引号).表达()
            ).表达(),
            r'\\\(([^\\\)]*)\\\)|`([^`]*)`')
